#### Terraform Plan - `dev` 🏗️
```
module.rds.random_password.db_password: Refreshing state... [id=none]
module.ecs.data.aws_region.current: Reading...
module.frontend.data.aws_caller_identity.current: Reading...
module.ecs.data.aws_iam_policy_document.ecs_assume_role: Reading...
module.frontend.aws_cloudfront_origin_access_control.this: Refreshing state... [id=E1CFSC7SG56LXQ]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0ba3a9abd086e9f7e]
module.ecs.aws_ecs_cluster.this: Refreshing state... [id=arn:aws:ecs:ap-northeast-1:427979936961:cluster/airas-dev-cluster]
module.vpc.aws_vpc.this: Refreshing state... [id=vpc-06e3ac500fac3ae4c]
module.frontend.aws_s3_bucket.frontend: Refreshing state... [id=airas-dev-frontend]
module.ecs.data.aws_region.current: Read complete after 0s [id=ap-northeast-1]
module.ecs.aws_cloudwatch_log_group.ecs: Refreshing state... [id=/ecs/airas-dev]
module.frontend.aws_cloudfront_function.basic_auth[0]: Refreshing state... [id=airas-dev-basic-auth]
module.ecs.data.aws_iam_policy_document.ecs_assume_role: Read complete after 0s [id=1077804475]
module.rds.aws_secretsmanager_secret.db_password: Refreshing state... [id=arn:aws:secretsmanager:ap-northeast-1:427979936961:secret:airas/dev/db-password-drWWHZ]
module.ecs.aws_iam_role.ecs_task: Refreshing state... [id=airas-dev-ecs-task]
module.frontend.data.aws_caller_identity.current: Read complete after 1s [id=427979936961]
module.ecs.aws_iam_role.ecs_execution: Refreshing state... [id=airas-dev-ecs-execution]
module.ecs.aws_iam_role_policy_attachment.ecs_execution: Refreshing state... [id=airas-dev-ecs-execution-20260221155811897600000002]
module.ecs.aws_ecs_task_definition.this: Refreshing state... [id=airas-dev-backend]
module.vpc.aws_internet_gateway.this: Refreshing state... [id=igw-0ebc8828c27b3d7ff]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-084eb66d08dba076e]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0dab3205cd79e392f]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0ac24092c648753f7]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0ff387e9382915106]
module.ecs.aws_security_group.alb: Refreshing state... [id=sg-0ac6c8faf6a48af57]
module.ecs.aws_lb_target_group.this: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:427979936961:targetgroup/airas-dev-tg/a284ebaaa9978ac2]
module.vpc.aws_route_table.public: Refreshing state... [id=rtb-0689fb81b5ba5c457]
module.frontend.aws_s3_bucket_public_access_block.frontend: Refreshing state... [id=airas-dev-frontend]
module.frontend.aws_s3_bucket_versioning.frontend: Refreshing state... [id=airas-dev-frontend]
module.frontend.aws_s3_bucket_server_side_encryption_configuration.frontend: Refreshing state... [id=airas-dev-frontend]
module.frontend.aws_cloudfront_distribution.this: Refreshing state... [id=EDZXNX8X40VRP]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0512122df70e71032]
module.ecs.aws_security_group.ecs: Refreshing state... [id=sg-0a548a18d043b0d06]
module.ecs.aws_lb.this: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:427979936961:loadbalancer/app/airas-dev-alb/19a93d48bd24d161]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0aa264f36177eea2c]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0db280ab36a4073e2]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0172598c99ba4c137]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0fe3ff7d4df13427d]
module.rds.aws_db_subnet_group.this: Refreshing state... [id=airas-dev-db-subnet]
module.frontend.aws_s3_bucket_policy.frontend: Refreshing state... [id=airas-dev-frontend]
module.rds.aws_security_group.rds: Refreshing state... [id=sg-06eaf0bd48cb92604]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0b6a194735d9cc411]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0fb541d6d9b35d197]
module.ecs.aws_lb_listener.http: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:427979936961:listener/app/airas-dev-alb/19a93d48bd24d161/0354da7510c96929]
module.monitoring.aws_cloudwatch_metric_alarm.alb_5xx: Refreshing state... [id=airas-dev-alb-5xx]
module.rds.aws_db_instance.this: Refreshing state... [id=db-BGESMPNBLS7ZIKQK5QE6KJ5IVI]
module.rds.aws_secretsmanager_secret_version.db_password: Refreshing state... [id=arn:aws:secretsmanager:ap-northeast-1:427979936961:secret:airas/dev/db-password-drWWHZ|terraform-20260221160905866600000003]
module.monitoring.aws_cloudwatch_metric_alarm.rds_cpu_high: Refreshing state... [id=airas-dev-rds-cpu-high]
module.monitoring.aws_cloudwatch_metric_alarm.rds_connections_high: Refreshing state... [id=airas-dev-rds-connections-high]
module.monitoring.aws_cloudwatch_metric_alarm.rds_storage_low: Refreshing state... [id=airas-dev-rds-storage-low]
module.ecs.aws_ecs_service.this: Refreshing state... [id=arn:aws:ecs:ap-northeast-1:427979936961:service/airas-dev-cluster/airas-dev-backend]
module.monitoring.aws_cloudwatch_metric_alarm.ecs_cpu_high: Refreshing state... [id=airas-dev-ecs-cpu-high]
module.monitoring.aws_cloudwatch_metric_alarm.ecs_memory_high: Refreshing state... [id=airas-dev-ecs-memory-high]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.ecs.aws_ecs_service.this will be updated in-place
  ~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:ap-northeast-1:427979936961:service/airas-dev-cluster/airas-dev-backend"
        name                               = "airas-dev-backend"
        tags                               = {
            "Name" = "airas-dev-backend"
        }
      ~ task_definition                    = "arn:aws:ecs:ap-northeast-1:427979936961:task-definition/airas-dev-backend:7" -> (known after apply)
        # (16 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.ecs.aws_ecs_task_definition.this must be replaced
-/+ resource "aws_ecs_task_definition" "this" {
      ~ arn                      = "arn:aws:ecs:ap-northeast-1:427979936961:task-definition/airas-dev-backend:1" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ap-northeast-1:427979936961:task-definition/airas-dev-backend" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ image            = "427979936961.dkr.ecr.ap-northeast-1.amazonaws.com/airas-backend:latest" -> "427979936961.dkr.ecr.ap-northeast-1.amazonaws.com/airas-backend:dev"
                  - mountPoints      = []
                    name             = "backend"
                  ~ portMappings     = [
                      ~ {
                          - hostPort      = 8000
                            # (2 unchanged attributes hidden)
                        },
                    ]
                  - systemControls   = []
                  - volumesFrom      = []
                    # (3 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "airas-dev-backend" -> (known after apply)
      ~ revision                 = 1 -> (known after apply)
        tags                     = {
            "Name" = "airas-dev-backend"
        }
        # (10 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```
*Pushed by: @fuyu-quant*